Конфигурация/Documents/РасчетНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РасчетНДФЛ</Name>
			<BasedOn>
				<xr:Item>Document.ВыводЦенныхБумаг</xr:Item>
				<xr:Item>Document.ВыводДенежныхСредств</xr:Item>
				<xr:Item>Document.Оплата</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НачисленияНалогов</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.БазаНачисленияНДФЛ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДФЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДФЛРанееНачисленный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДФЛНачисленный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОтчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОснованияРасчетаНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наследник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НалоговаяБаза</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтавкаНДФЛ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДФЛ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДоходаВычета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыВычетовНДФЛ</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыДоходовНДФЛ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Год</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месяц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма2НДФЛ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВыводЦенныхБумаг</v8:Type>
								<v8:Type>cfg:DocumentRef.Оплата</v8:Type>
								<v8:Type>cfg:DocumentRef.ВыводДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НалоговаяБаза2025</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидНалогооблагаемойБазы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНалогооблагаемыхБаз</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Год</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месяц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДоходовНДФЛ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидВычета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыВычетовНДФЛ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДФЛДоход</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДФЛВычет</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДохода</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРасхода</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДФЛ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДФЛ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНалога</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУменьшающаяНалог</Name>
							<Comment>для дивидендов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РаспределяемыеРасходы</Name>
							<Comment>распределяемые расходы не ЦБ</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ВводыВыводыАктивовВВалютеУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ВводыВыводыАктивовВВалютеУчета</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БалансоваяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РыночнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАктива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперацииВводаВыводаДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/Enums/ОснованияРасчетаНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ОснованияРасчетаНДФЛ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыводАктивов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонецНалоговогоПериода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводАктивовДругомуПрофучастнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасторжениеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаНаследнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаДивидендов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/СтавкиНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтавкиНДФЛ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ставка0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка09</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка13</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка15</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка30</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка35</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/РасчетНДФЛ/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ВСПОМОГАТЕЛЬНЫЕ_ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста 
Функция СписокВыбораДляОснованияРасчета(СчетДУ)
	
	Список = Новый Массив;
	
	Если ЗначениеЗаполнено(СчетДУ) Тогда 
		ВидДоговораДУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетДУ, "ВидДоговораДоверительногоУправления");
	Иначе
		Возврат Список;
	КонецЕсли;	
	
	Если ВидДоговораДУ = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет") Тогда 
		Список.Добавить(ПредопределенноеЗначение("Перечисление.ОснованияРасчетаНДФЛ.ВыплатаДивидендов"));
		//Список.Добавить(ПредопределенноеЗначение("Перечисление.ОснованияРасчетаНДФЛ.КонецНалоговогоПериода"));
		Список.Добавить(ПредопределенноеЗначение("Перечисление.ОснованияРасчетаНДФЛ.РасторжениеДоговора"));
		Список.Добавить(ПредопределенноеЗначение("Перечисление.ОснованияРасчетаНДФЛ.ПереводАктивовДругомуПрофучастнику"));
		Список.Добавить(ПредопределенноеЗначение("Перечисление.ОснованияРасчетаНДФЛ.ВыплатаНаследнику"));
		Список.Добавить(ПредопределенноеЗначение("Перечисление.ОснованияРасчетаНДФЛ.КорректировкаНалога"));
	Иначе
		Список.Добавить(ПредопределенноеЗначение("Перечисление.ОснованияРасчетаНДФЛ.ВыводАктивов")); 
		Список.Добавить(ПредопределенноеЗначение("Перечисление.ОснованияРасчетаНДФЛ.ВыплатаДивидендов"));
		Список.Добавить(ПредопределенноеЗначение("Перечисление.ОснованияРасчетаНДФЛ.КонецНалоговогоПериода"));
		Список.Добавить(ПредопределенноеЗначение("Перечисление.ОснованияРасчетаНДФЛ.РасторжениеДоговора"));	
		Список.Добавить(ПредопределенноеЗначение("Перечисление.ОснованияРасчетаНДФЛ.ВыплатаНаследнику"));
	КонецЕсли;	
	
	Возврат Список;
		
КонецФункции	

&НаСервере
Процедура СоздатьРеквизитТабличныйДокументНаСервере(ИмяРеквизита, ЗаголовокСтраницы, ЗначениеРеквизита)
	
	Если ЭтаФорма.Элементы.Найти(ИмяРеквизита) = Неопределено Тогда 
		
		НовыйРеквизитТД = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("ТабличныйДокумент"));
		
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить(НовыйРеквизитТД);
		ЭтаФорма.ИзменитьРеквизиты(МассивРеквизитов);
		
		НоваяСтраница = ЭтаФорма.Элементы.Добавить("Страница"+ ИмяРеквизита, Тип("ГруппаФормы"), ЭтаФорма.Элементы.СтраницыГоды);
		НоваяСтраница.Вид = ВидГруппыФормы.Страница;
		НоваяСтраница.Заголовок = ЗаголовокСтраницы;
		
		НовоеПолеТД = Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), НоваяСтраница);
		НовоеПолеТД.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовоеПолеТД.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
		НовоеПолеТД.ПутьКДанным = ИмяРеквизита;
		
	КонецЕсли;	
	ЭтаФорма[ИмяРеквизита] = ЗначениеРеквизита;

КонецПроцедуры			

&НаСервере
Процедура УдалитьДополнительныеРеквизитыНаСервере()
	
	КоличествоСтраниц = ЭтаФорма.Элементы.СтраницыГоды.ПодчиненныеЭлементы.Количество();
	
	Для Индекс = -КоличествоСтраниц по -1 Цикл 
		Страница =  ЭтаФорма.Элементы.СтраницыГоды.ПодчиненныеЭлементы[-Индекс - 1];
		
		ИмяПоляТД = Прав(Страница.Имя, 9);  //СтраницаОтчет2020		
		УдалемыйРеквизит = ЭтаФорма.Элементы.Найти(ИмяПоляТД); 
	
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить(УдалемыйРеквизит.ПутьКДанным);
		ЭтаФорма.ИзменитьРеквизиты( ,МассивРеквизитов);
		
		ЭтаФорма.Элементы.Удалить(УдалемыйРеквизит);
		ЭтаФорма.Элементы.Удалить(Страница);			
	КонецЦикла;
		
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьЗаголовокЗакладкиВыводы()
	
	СуммаВывода = Объект.Основания.Итог("Сумма");     
	Если Объект.ОснованиеРасчета = ПредопределенноеЗначение("Перечисление.ОснованияРасчетаНДФЛ.ВыплатаДивидендов") Тогда 
		ТекстСообщения = "Выплата дивидендов: ";
	Иначе
		ТекстСообщения = "Выводы: ";
	КонецЕсли;
	Если СуммаВывода <> 0 Тогда
		ЭтаФорма.Элементы.СтрВыводы.Заголовок = ТекстСообщения + СуммаВывода + " руб.";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма, Элемент = Неопределено)
	
	Элементы = Форма.Элементы;
	
	Элементы.Наследник.Видимость = Ложь; 
	Элементы.НалоговаяБаза1СуммаУменьшающаяНалог.Видимость = Ложь; 
	Элементы.НалоговаяБаза1РаспределяемыеРасходы.Видимость = Ложь; 
	
	Если Форма.Объект.ОснованиеРасчета = ПредопределенноеЗначение("Перечисление.ОснованияРасчетаНДФЛ.ВыплатаНаследнику") Тогда 
		Элементы.Наследник.Видимость = Истина;
	ИначеЕсли Форма.Объект.ОснованиеРасчета = ПредопределенноеЗначение("Перечисление.ОснованияРасчетаНДФЛ.ВыплатаДивидендов") Тогда 
		Элементы.НалоговаяБаза1СуммаУменьшающаяНалог.Видимость = Истина; 
	ИначеЕсли Форма.Объект.ОснованиеРасчета = ПредопределенноеЗначение("Перечисление.ОснованияРасчетаНДФЛ.КонецНалоговогоПериода")
		ИЛИ Форма.Объект.ОснованиеРасчета = ПредопределенноеЗначение("Перечисление.ОснованияРасчетаНДФЛ.РасторжениеДоговора")
		ИЛИ Форма.Объект.ОснованиеРасчета = ПредопределенноеЗначение("Перечисление.ОснованияРасчетаНДФЛ.ВыплатаНаследнику")Тогда 
		Элементы.НалоговаяБаза1РаспределяемыеРасходы.Видимость = Истина;
	КонецЕсли;
		
	Если Форма.СтарыйИнтерфейс Тогда 
		Элементы.ГруппаНДФЛ.Видимость = Истина;
		Элементы.СтрНДФЛ.Видимость = Истина;
		Элементы.СтрОтчет.Видимость = Истина;
	Иначе 
		Элементы.ГруппаНДФЛ.Видимость = Ложь;
		Элементы.СтрНДФЛ.Видимость = Ложь;
		Элементы.СтрОтчет.Видимость = Ложь;
	КонецЕсли;  
	
	Если Форма.РучнойРасчет Тогда  
		Элементы.СуммаНДФЛНачисленного.ТолькоПросмотр = Ложь; 
	Иначе
		Элементы.СуммаНДФЛНачисленного.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)	
	//изменение как таковое будет редко. Это для выбора Счета ДУ в новом документе
	Элементы.ОснованиеРасчета.СписокВыбора.ЗагрузитьЗначения(СписокВыбораДляОснованияРасчета(Объект.СчетДоверительногоУправления));	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЭтаФорма.ЭтоНовыйДокумент = Истина;
	КонецЕсли;
	
	Если ЭтаФорма.Параметры.Основание <> Неопределено Тогда 
		ВидДоговораДУ = ЭтаФорма.Параметры.Основание.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления;
		Если НЕ (ВидДоговораДУ = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет ИЛИ 
			ВидДоговораДУ = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица) Тогда	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создание Расчета НДФЛ имеет смысл только для физических лиц и ИИС",,,,Отказ);
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	Элементы.ОснованиеРасчета.СписокВыбора.ЗагрузитьЗначения(СписокВыбораДляОснованияРасчета(Объект.СчетДоверительногоУправления))
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ЗаполнитьПодтверждениеОперацииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
		
	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);
	
	ЗаполнитьНаименованиеВидаДоходаВычета();
	
	ЭтоНовыйДокумент = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперацииНаСервере();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
//	ТекущийОбъект.ДанныеОтчета = Новый ХранилищеЗначения(ЭтаФорма.ДанныеОтчетаФорма, Новый СжатиеДанных(9));

	ДанныеОтчетаСтруктура = Новый Структура;
	Для Каждого Страница из ЭтаФорма.Элементы.СтраницыГоды.ПодчиненныеЭлементы Цикл 
		ИмяПоляТД = Прав(Страница.Имя, 9);  //СтраницаОтчет2020
		ДанныеОтчетаСтруктура.Вставить(ИмяПоляТД, ЭтаФорма[ИмяПоляТД]); 
	КонецЦикла;	
	
	ТекущийОбъект.ДанныеОтчета = Новый ХранилищеЗначения(ДанныеОтчетаСтруктура, Новый СжатиеДанных(9));

КонецПроцедуры

&НаСервере
Функция ВернутьНаименованиеВидаДоходаВычетаНаСервере(ВидДоходаВычета)	
	Возврат ВидДоходаВычета.Наименование;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьНаименованиеВидаДоходаВычета()	
	
	Для Каждого СтрокаТаблицы из Объект.НалоговаяБаза Цикл 	
		Если СтрокаТаблицы.ВидДоходаВычета <> Неопределено Тогда 
			СтрокаТаблицы.ВидДоходаНаименование = ВернутьНаименованиеВидаДоходаВычетаНаСервере(СтрокаТаблицы.ВидДоходаВычета);
		КонецЕсли;			                    
	КонецЦикла;	

	Для Каждого СтрокаТаблицы из Объект.НалоговаяБаза2025 Цикл 	
		Если СтрокаТаблицы.ВидДохода <> Неопределено Тогда 
			СтрокаТаблицы.ВидДоходаНаименование = ВернутьНаименованиеВидаДоходаВычетаНаСервере(СтрокаТаблицы.ВидДохода);
		КонецЕсли;
		Если СтрокаТаблицы.ВидВычета <> Неопределено Тогда 
			СтрокаТаблицы.ВидВычетаНаименование = ВернутьНаименованиеВидаДоходаВычетаНаСервере(СтрокаТаблицы.ВидВычета);
		КонецЕсли;			                    		
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановкаДатыРасчета()
	
	Если Объект.ОснованиеРасчета = ПредопределенноеЗначение("Перечисление.ОснованияРасчетаНДФЛ.КонецНалоговогоПериода") Тогда 	
		Если КонецДня(Объект.Дата) <> КонецГода(Объект.Дата) Тогда 
			Объект.ДатаРасчета = КонецГода(ДобавитьМесяц(Объект.Дата, -12)); 
		Иначе 
			Объект.ДатаРасчета = Объект.Дата;
		КонецЕсли;	
	Иначе
		Объект.ДатаРасчета = НачалоДня(Объект.Дата);
	КонецЕсли;	
		
КонецПроцедуры	

&НаКлиенте
Процедура ДатаРасчетаПриИзменении(Элемент)
	Если Объект.ДатаРасчета > НачалоДня(Объект.Дата) Тогда 
		Объект.ДатаРасчета = НачалоДня(Объект.Дата);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата расчета не может быть позже даты документа.", Объект, "ДатаРасчета");
	КонецЕсли;	
	УстановкаДатыРасчета();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСуммуВывода(ВыбранноеЗначение)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.ВыводДенежныхСредств") Тогда 
		Возврат ВыбранноеЗначение.Сумма;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.ВыводЦенныхБумаг") Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВыводЦенныхБумагЦенныеБумаги.СуммаРынокВВалютеУчета + ВыводЦенныхБумагЦенныеБумаги.СуммаКупонаРынокВВалютеУчета) КАК Сумма
		|ИЗ
		|	Документ.ВыводЦенныхБумаг.ЦенныеБумаги КАК ВыводЦенныхБумагЦенныеБумаги
		|ГДЕ
		|	ВыводЦенныхБумагЦенныеБумаги.Ссылка = &ДокументВывод";
		Запрос.УстановитьПараметр("ДокументВывод", ВыбранноеЗначение);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			Возврат Выборка.Сумма;	
		КонецЦикла;
		
	КонецЕсли;			
	
	
	
КонецФункции

&НаКлиенте
Процедура ВыводыДокументВыводОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Тип") Тогда 
		Элемент.Родитель.ТекущиеДанные.Сумма = ПолучитьСуммуВывода(ВыбранноеЗначение);
	КонецЕсли;
	ОбновитьЗаголовокЗакладкиВыводы();
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеРасчетаПриИзменении(Элемент)
	//ОснованиеРасчетаПриИзмененииНаСервере();
	УстановкаДатыРасчета();	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);       
	УстановкаДатыРасчета();
КонецПроцедуры

&НаКлиенте
Процедура СтарыйИнтерфейсПриИзменении(Элемент)
	НастроитьВидимостьИДоступность(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РучнойРасчетПриИзменении(Элемент)
	НастроитьВидимостьИДоступность(ЭтаФорма);
	Если НЕ ЭтаФорма.РучнойРасчет Тогда
		НалоговаяБаза1ПриИзмененииНаСервере();  //пересчитаем налог. Если галку отжали, то восстановим расчетное значение   
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаНДФЛНачисленногоПриИзменении(Элемент)
	НалоговаяБаза1ПриИзмененииНаСервере();  // пересчитаем налог по введенному значению. 
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
			
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
		
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	Если НЕ ЭтаФорма.ЭтоНовыйДокумент Тогда 
				
		ДанныеОтчетаТекущие = Объект.Ссылка.ДанныеОтчета.Получить();	
		//
		Если ТипЗнч(ДанныеОтчетаТекущие) = Тип("ТабличныйДокумент") Тогда 
			ГодРасчета = Год(Объект.ДатаРасчета);
			СоздатьРеквизитТабличныйДокументНаСервере("Отчет" + Формат(ГодРасчета, "ЧГ="), Формат(ГодРасчета, "ЧГ="), ДанныеОтчетаТекущие);
		ИначеЕсли ТипЗнч(ДанныеОтчетаТекущие) = Тип("Структура") Тогда 
			Для Каждого ЗначениеСтруктуры из ДанныеОтчетаТекущие Цикл 				
				СоздатьРеквизитТабличныйДокументНаСервере(ЗначениеСтруктуры.Ключ, Прав(ЗначениеСтруктуры.Ключ, 4), ЗначениеСтруктуры.Значение);
			КонецЦикла;	
		КонецЕсли;	
	Иначе
		Если ЭтаФорма.Параметры.Основание <> Неопределено Тогда 
			//ввод на основании
			Заполнить2НаСервере();
		КонецЕсли; 	
	КонецЕсли;
	
	ЗаполнитьРасчетныеРеквизитыНаСервере();
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере()

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()

	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЗаголовокЗакладкиВыводы();
	ЗаполнитьНаименованиеВидаДоходаВычета();
			
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОснованияНаСервере()
	
	Если Объект.ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ВыплатаДивидендов Тогда 
		
		//Расчет НДЛФ можем делать не обязательно в день оплаты. 
		// Сначала получим все оплаты, потом оплаты по которым сделаны другие Расчеты
		// Оставим только оплату, по которой еще нет Расчета. 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОплатаОснования.Ссылка КАК Оплата,
		|	ОплатаОснования.СуммаОплаты КАК СуммаОплаты
		|ПОМЕСТИТЬ _ОплатыВсе
		|ИЗ
		|	Документ.Оплата.Основания КАК ОплатаОснования
		|ГДЕ
		|	ОплатаОснования.Ссылка.Организация = &Организация
		|	И ОплатаОснования.Ссылка.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОплатаОснования.Ссылка.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции)
		|	И ОплатаОснования.Ссылка.Проведен
		|	И ОплатаОснования.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаЗапроса, ГОД) И КОНЕЦПЕРИОДА(&ДатаЗапроса, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетНДФЛОснования.Основание КАК Оплата
		|ПОМЕСТИТЬ _ОплатыВОсновании
		|ИЗ
		|	Документ.РасчетНДФЛ.Основания КАК РасчетНДФЛОснования
		|ГДЕ
		|	РасчетНДФЛОснования.Ссылка.Организация = &Организация
		|	И РасчетНДФЛОснования.Ссылка.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И РасчетНДФЛОснования.Ссылка.ОснованиеРасчета = ЗНАЧЕНИЕ(Перечисление.ОснованияРасчетаНДФЛ.ВыплатаДивидендов)
		|	И РасчетНДФЛОснования.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаЗапроса, ГОД) И КОНЕЦПЕРИОДА(&ДатаЗапроса, ДЕНЬ)
		|	И РасчетНДФЛОснования.Ссылка <> &РасчетНДФЛ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОплатыВсе.Оплата КАК Основание,
		|	_ОплатыВсе.СуммаОплаты КАК Сумма
		|ИЗ
		|	_ОплатыВсе КАК _ОплатыВсе
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОплатыВОсновании КАК _ОплатыВОсновании
		|		ПО _ОплатыВсе.Оплата = _ОплатыВОсновании.Оплата
		|ГДЕ
		|	_ОплатыВОсновании.Оплата ЕСТЬ NULL";  
		
		ТекстСообщения = " нет оплат по начислению дивидендов";
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.Регистратор КАК Основание,
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
		|			&ДатаЗапроса,
		|			КОНЕЦПЕРИОДА(&ДатаЗапроса, ДЕНЬ),
		|			Регистратор,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)) КАК ВводыВыводыАктивовВВалютеУчетаОбороты";
		
		
		ТекстСообщения = " нет выводов денег и/или выводов ценных бумаг"; 
		
	КонецЕсли;	

	ДатаЗапроса = Объект.ДатаРасчета;
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ДатаЗапроса", ДатаЗапроса); 
	Запрос.УстановитьПараметр("РасчетНДФЛ", Объект.Ссылка);
	
	Объект.Основания.Загрузить(Запрос.Выполнить().Выгрузить());
	
	СуммаОснований = Объект.Основания.Итог("Сумма");
	
	Если (СуммаОснований = 0) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На " + Формат(ДатаЗапроса,"ДФ=dd.MM.yyyy") + ТекстСообщения);
	КонецЕсли;	
		
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьНаСервере()
	Перем ДанныеПрошлыхЛет;
	
	Если Объект.ОснованиеРасчета <> Перечисления.ОснованияРасчетаНДФЛ.КонецНалоговогоПериода Тогда 
		ЗаполнитьОснованияНаСервере();	
	КонецЕсли;		
	
	//удалим программно созданные реквизиты. 
	УдалитьДополнительныеРеквизитыНаСервере();
	
	//Документы за прошлые годы по ИИС
	Если Объект.ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ПереводАктивовДругомуПрофучастнику 
		ИЛИ Объект.ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.КорректировкаНалога 
		ИЛИ (Объект.ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.РасторжениеДоговора И Объект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		ИЛИ (Объект.ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ВыплатаНаследнику И Объект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет) Тогда
					
		ГодОт = Год(Объект.СчетДоверительногоУправления.ДатаЗаключения);
		ГодДо = Год(Объект.ДатаРасчета)-1;		
		Для ГодРасчета=ГодОт по ГодДо Цикл 		
			ДатаРасчетаПрошлое = Дата(ГодРасчета, 12, 31);
			
			Результат = Документы.РасчетНДФЛ.Расчет_НДФЛ(Объект.Организация, Объект.СчетДоверительногоУправления, КонецДня(ДатаРасчетаПрошлое), ,Объект.ОснованиеРасчета);	
			Если Результат = Неопределено Тогда 
				Продолжить;
			КонецЕсли;				
			СоздатьРеквизитТабличныйДокументНаСервере("Отчет" + Формат(ГодРасчета, "ЧГ="), Формат(ГодРасчета, "ЧГ="), Результат.ДокументРезультат);			
			//	ДанныеПрошлыхЛет.Вставить("ТаблицаРезультат" + Формат(ГодРасчета, "ЧГ="), Результат.ТаблицаРезультат);
			Если ДанныеПрошлыхЛет = Неопределено Тогда 
				ДанныеПрошлыхЛет = Результат.ТаблицаРезультат.Скопировать();
			Иначе
				РаботаСКоллекциями.ТаблицаЗначений_Дополнить(Результат.ТаблицаРезультат, ДанныеПрошлыхЛет); 
			Конецесли;	
		
		КонецЦикла;	
		
	КонецЕсли;		
	
	//Текущий период
	Результат = Документы.РасчетНДФЛ.Расчет_НДФЛ(Объект.Организация, Объект.СчетДоверительногоУправления, КонецДня(Объект.ДатаРасчета), ,Объект.ОснованиеРасчета);	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	Если ДанныеПрошлыхЛет <> Неопределено Тогда
		РаботаСКоллекциями.ТаблицаЗначений_Дополнить(ДанныеПрошлыхЛет, Результат.ТаблицаРезультат); 
	КонецЕсли;	
	НДФЛРанееНачисленный = Результат.НДФЛРанееНачисленный;
	
	//расчет НДФЛ
	СуммаВывода = Объект.Основания.Итог("Сумма");
	
	Документы.РасчетНДФЛ.ЗаполнитьДокумент(Объект, Результат, СуммаВывода);	
	СоздатьРеквизитТабличныйДокументНаСервере("Отчет" + Формат(Год(Объект.ДатаРасчета), "ЧГ="), Формат(Год(Объект.ДатаРасчета), "ЧГ="), Результат.ДокументРезультат);
		
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;	
		
	Если Объект.НалоговаяБаза.Количество() > 0 ИЛИ Объект.Основания.Количество()> 0 Тогда 
		Ответ = Вопрос("Текущие данные будут очищены. Перезаполнить документ?", РежимДиалогаВопрос.ОКОтмена, 15);
		Если Ответ = КодВозвратаДиалога.Отмена Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	ЗаполнитьНаСервере();
	ОбновитьЗаголовокЗакладкиВыводы();
	ЗаполнитьНаименованиеВидаДоходаВычета();
	
КонецПроцедуры

//--------------------------------------- Новые процедуры заполнения с 2025 г. ---------------------------------
&НаСервере
Процедура ЗаполнитьРасчетныеРеквизитыНаСервере(РежимРучнаяПравка = Ложь) 
	
	Если НЕ РежимРучнаяПравка Тогда 
		
		Запрос = Новый Запрос;  
		
		Запрос.Текст =  
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(НачисленияНалогов.Сумма) КАК СуммаНалога,
		|	СУММА(ВЫБОР
		|			КОГДА НачисленияНалогов.Примечание = ""Сумма уменьшающая налог по дивидендам""
		|				ТОГДА 0
		|			ИНАЧЕ НачисленияНалогов.БазаНалога
		|		КОНЕЦ) КАК БазаНалога
		|ИЗ
		|	РегистрНакопления.НачисленияНалогов КАК НачисленияНалогов
		|ГДЕ
		|	НачисленияНалогов.Организация = &Организация
		|	И НачисленияНалогов.Налогоплательщик = &ФизЛицо
		|	И ВЫРАЗИТЬ(НачисленияНалогов.Основание КАК Документ.РасчетНДФЛ).ОснованиеРасчета В (&ОснованияРасчетов)
		|	И НачисленияНалогов.Основание <> &ДокументОснование
		|	И НачисленияНалогов.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ГОД) И &Период
		|	И НачисленияНалогов.Активность";
		
		Запрос.УстановитьПараметр("Организация", Объект.Организация);     
		ФизЛицо = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(Объект.СчетДоверительногоУправления, Объект.Дата);
		Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
		Запрос.УстановитьПараметр("Период", Объект.Дата);
		Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
		
		
		СписокОснований = Новый Массив;
		Если Объект.ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ВыплатаДивидендов Тогда
			СписокОснований.Добавить(Перечисления.ОснованияРасчетаНДФЛ.ВыплатаДивидендов);  
		ИначеЕсли Объект.ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.КорректировкаНалога Тогда
			СписокОснований.Добавить(Перечисления.ОснованияРасчетаНДФЛ.ВыводАктивов);
			СписокОснований.Добавить(Перечисления.ОснованияРасчетаНДФЛ.КонецНалоговогоПериода);
			СписокОснований.Добавить(Перечисления.ОснованияРасчетаНДФЛ.РасторжениеДоговора);
			СписокОснований.Добавить(Перечисления.ОснованияРасчетаНДФЛ.ВыплатаНаследнику);
			//СписокОснований.Добавить(Перечисления.ОснованияРасчетаНДФЛ.ПереводАктивовДругомуПрофучастнику);
		Иначе 
			СписокОснований.Добавить(Перечисления.ОснованияРасчетаНДФЛ.ВыводАктивов);     
			// у физлиц в течение года может быть только это основание. 
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ОснованияРасчетов", СписокОснований);  
		
		НачисленияНалога = Запрос.Выполнить().Выгрузить(); 
		
		Для Каждого СтрокаДвижения из НачисленияНалога Цикл 
			ЭтаФорма.СуммаНДЛФРанееНачисленного = СтрокаДвижения.СуммаНалога;
			ЭтаФорма.НОБсначалаГода = СтрокаДвижения.БазаНалога;
		КонецЦикла; 
		
	КонецЕсли;
	
	//при ручной правке обновляем только эти реквизиты
	Если Объект.ОснованиеРасчета = Перечисления.ОснованияРасчетаНДФЛ.ВыплатаДивидендов Тогда
		ЭтаФорма.НОБПолучено = Объект.НалоговаяБаза2025.Итог("СуммаНДФЛДоход");
	Иначе	
		ЭтаФорма.НОБПолучено = Объект.НалоговаяБаза2025.Итог("СуммаНДФЛДоход") - Объект.НалоговаяБаза2025.Итог("СуммаНДФЛВычет");
	КонецЕсли;
	ЭтаФорма.СуммаНДФЛНачисленного = Объект.НалоговаяБаза2025.Итог("СуммаНалога");  
	
	ЭтаФорма.НОБВсего = ЭтаФорма.НОБсначалаГода + ЭтаФорма.НОБПолучено;
	ЭтаФорма.СуммаНДФЛ = ЭтаФорма.СуммаНДЛФРанееНачисленного + ЭтаФорма.СуммаНДФЛНачисленного;      
	
КонецПроцедуры
	
&НаСервере
Процедура Заполнить2НаСервере()

	
	Если Объект.ОснованиеРасчета <> Перечисления.ОснованияРасчетаНДФЛ.КонецНалоговогоПериода Тогда 
		ЗаполнитьОснованияНаСервере();	
	КонецЕсли;	
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");  
	ТекущийОбъект.ЗаполнитьТабличнуюЧасть();
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
		
	ЗаполнитьРасчетныеРеквизитыНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура Заполнить2(Команда)

	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;
		
	Если Объект.НалоговаяБаза.Количество() > 0 ИЛИ Объект.Основания.Количество()> 0 Тогда 
		Ответ = Вопрос("Текущие данные будут очищены. Перезаполнить документ?", РежимДиалогаВопрос.ОКОтмена, 15);
		Если Ответ = КодВозвратаДиалога.Отмена Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Заполнить2НаСервере();
	ОбновитьЗаголовокЗакладкиВыводы();
	ЗаполнитьНаименованиеВидаДоходаВычета();
	
КонецПроцедуры

&НаСервере
Процедура НалоговаяБаза1ПриИзмененииНаСервере()
	
    //выглядит страшно. Ручная правка будет явление редкое. Надеюсь. 
	СуммаДоходаНаНачалоРасчета = ЭтаФорма.НОБсначалаГода;  
	СуммаНалогаРанееНачисленного = ЭтаФорма.СуммаНДЛФРанееНачисленного;
	
	ЭтоРезидент = Справочники.ЮрФизЛица.ЯвляетсяРезидентом(Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(Объект.СчетДоверительногоУправления, Объект.Дата), Объект.Организация, Объект.Дата);
	Если ЭтоРезидент <> Неопределено Тогда 
		Если ЭтоРезидент Тогда 
			ОсновнаяСтавка = Перечисления.СтавкиНДФЛ.Ставка13;
		Иначе
			ОсновнаяСтавка = Перечисления.СтавкиНДФЛ.Ставка30;
		КонецЕсли;	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У " + Объект.СчетДоверительногоУправления + " на " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy") + " не заполнены анкетные данные. Статус резидента неопределен.");
		Возврат;
	КонецЕсли;
	
	ПороговаяСумма = РаботаСНалогамиКлиентСервер.ПорогПримененияСтавкиНДФЛ15Процентов(Объект.ДатаРасчета, ОсновнаяСтавка); 
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект"); 
	ТаблицаНОБ = Объект.НалоговаяБаза2025.Выгрузить();
	ТекущийОбъект.РасчетСуммыНалога(ТаблицаНОБ, СуммаДоходаНаНачалоРасчета, ПороговаяСумма, СуммаНалогаРанееНачисленного, ОсновнаяСтавка, ?(ЭтаФорма.РучнойРасчет, ЭтаФорма.СуммаНДФЛНачисленного, 0), Истина); 
	Объект.НалоговаяБаза2025.Загрузить(ТаблицаНОБ);
	
	ЗаполнитьРасчетныеРеквизитыНаСервере(Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура НалоговаяБаза1ПриИзменении(Элемент)
	
	НалоговаяБаза1ПриИзмененииНаСервере();
		
КонецПроцедуры
